{
	"aboutMe": "Full Stack Software Engineer with over three years of experience in JavaScript, Node.js, and a strong background utilizing the MERN stack. Passionate about my work and enjoy learning new things. When away from my desk, you can find me playing sports, at the gym, or trying out new restaurants with my friends and family.",
	"experience": [
		{
			"title": "Software Developer",
			"company": "Altice USA",
			"dates": {
				"start": "May 2022",
				"end": "Present"
			},
			"description": [
				"Developing new software to move away from legacy applications aimed to greatly enhance internal and external user experience.",
				"Employ strategic planning and test-driven development in an Agile environment that leverages cutting edge technologies.",
				"Clearly and regularly communicate with management and support teammates and new team member onboarding."
			],
			"projects": []
		},
		{
			"title": "Full-Stack Software Engineer",
			"company": "RECENT SOFTWARE ENGINEERING APPLICATIONS",
			"dates": {
				"start": "Dec 2020",
				"end": "May 2021"
			},
			"description": [],
			"projects": [
				{
					"name": "Blitvazon | Amazon-Styled Photos Microservice & Proxy Server",
					"techStack": ["React", "Styled-Components", "Express", "Node", "MongoDB"],
					"description": [
						"Developed front-end for photos and checkout microservices and integrated with other services via a proxy server utilizing REST APIs to share data across services.",
						"Utilized React to build encapsulated components and styled-components to modularize CSS and avoid competing classes amongst services.",
						"Implemented unit testing with Jest/Enzyme to ensure the stability of the React components under various types of application states.",
						"Deployed microservice by implementing a CircleCI pipeline into an AWS EC2 instance."
					]
				},
				{
					"name": "Spacework | WeWork-Styled SOA Photos Database & Proxy Server",
					"techStack": ["CouchDb", "Redis", "NGINX", "Express", "Node", "New Relic", "Loader.io"],
					"description": [
						"Designed and horizontally scaled the photos microservice back-end system from an inherited codebase to handle large amounts of traffic to preserve system availability, conforming to the RESTful API architectural style.",
						"Benchmarked database CRUD operations to optimize latency and performed stress testing on the deployed service REST API. Resulting in optimal service latency, throughput, and error rate.",
						"Configured a Redis cache to use an LFU cache eviction policy for faster read operations that averaged less than 50ms.",
						"Optimized the availability of the service under stress by implementing an NGINX reverse proxy to avoid unnecessary database reads with a micro-caching configuration to avoid serving stale data to the client resulting in a 2600% RPS increase with sub 1200ms response times and a 0% error rate under stress.",
						"Dockerized and deployed database, server, and proxy containers into a cluster of AWS EC2 instances."
					]
				}
			]
		},
		{
			"title": "Provider Enrollment Specialist",
			"company": "ACCENTURE",
			"dates": {
				"start": "Aug 2019",
				"end": "May 2022"
			},
			"description": [
				"Communicate directly with the client to ensure satisfaction during the rollout of the new Vendor Drug Program project.",
				"Perform end-to-end testing for newly released platform (PEMS) to identify bugs across the stack and enforce contract requirements.",
				"Perform PEMS platform user-testing to identify issues and bugs in the front-end by staging different application scenarios and testing the system capabilities and stability from a user's perspective.",
				"Manage system improvements related to changes in work instructions, procedures, and policies.",
				"Process medical provider applications and render TPIs for providers approved by the OIG."
			],
			"projects": []
		}
	],
	"education": [
		{
			"school": "Hack Reactor",
			"degreeName": "ADVANCED SOFTWARE ENGINEERING IMMERSIVE PROGRAM",
			"dates": {
				"start": "Sept 2020",
				"end": "Dec 2020"
			},
			"distinctions": [],
			"description": []
		},
		{
			"school": "Austin Community College",
			"degreeName": "ASSOCIATE OF SCIENCE IN BUSINESS ADMINISTRATION",
			"dates": {
				"start": "Jan 2017",
				"end": "May 2019"
			},
			"distinctions": ["GPA 3.7", "Member of the Honors Program"],
			"description": []
		}
	],
	"skills": [
		{
			"category": "Front-end",
			"names": ["TypeScript", "React", "Svelte", "jQuery", "HTML5", "CSS"]
		},
		{
			"category": "Back-end",
			"names": ["NodeJS", "REST APIs", "GRPC APIs", "noSQL", "SQL", "NGINX"]
		},
		{
			"category": "DevOps & Workflow",
			"names": ["AWS", "GCP", "Docker", "CircleCi", "Heroku", "Git", "Jira", "Trello"]
		}
	]
}
